# GroupBy

In [18]:
import pandas as pd

In [10]:
var = pd.DataFrame({"Name": ["a","b","c","d","a","b","c","d","a","b","c","d"],
                   "class":[1,2,3,4,5,6,7,8,9,10,11,12],
                   "roll":[21,22,23,24,25,26,27,28,29,30,31,32]})
var

   Name  class  roll
0     a      1    21
1     b      2    22
2     c      3    23
3     d      4    24
4     a      5    25
5     b      6    26
6     c      7    27
7     d      8    28
8     a      9    29
9     b     10    30
10    c     11    31
11    d     12    32

In [11]:
new_var = var.groupby("Name")
new_var

In [17]:
for x, y in new_var:
    print(x)
    print(y)
    print()
    print()

a
  Name  class  roll
0    a      1    21
4    a      5    25
8    a      9    29


b
  Name  class  roll
1    b      2    22
5    b      6    26
9    b     10    30


c
   Name  class  roll
2     c      3    23
6     c      7    27
10    c     11    31


d
   Name  class  roll
3     d      4    24
7     d      8    28
11    d     12    32

In [21]:
# to get a specific data items 


new_var.get_group("a")
new_var.get_group("b")

  Name  class  roll
1    b      2    22
5    b      6    26
9    b     10    30

In [22]:
# find the minimum data from the group items 

new_var.min()

      class  roll
Name
a         1    21
b         2    22
c         3    23
d         4    24

In [24]:
# find the maximum data from the group data 


new_var.max()

      class  roll
Name
a         9    29
b        10    30
c        11    31
d        12    32

In [25]:
#find the mean value of a specific data from the group 


new_var.mean()

      class  roll
Name
a       5.0  25.0
b       6.0  26.0
c       7.0  27.0
d       8.0  28.0

In [28]:
# --------------change the DataFrame into the list ------------



new_list = list(new_var)
new_list

[('a',
    Name  class  roll
  0    a      1    21
  4    a      5    25
  8    a      9    29),
 ('b',
    Name  class  roll
  1    b      2    22
  5    b      6    26
  9    b     10    30),
 ('c',
     Name  class  roll
  2     c      3    23
  6     c      7    27
  10    c     11    31),
 ('d',
     Name  class  roll
  3     d      4    24
  7     d      8    28
  11    d     12    32)]